def اضف_نفقات(نفقات, كمية, فئة):
    نفقات.append({'كمية': كمية, 'فئة': فئة})

def انطر_نفقات(نفقات):
    for نفقة in نفقات:
        print(f'🤑كمية: {نفقة["كمية"]}, فئة: {نفقة["فئة"]}🤑')

def مجموع_نفقات(نفقات):
    return sum(map(lambda نفقة: نفقة['كمية'],نفقات))

def مرشح_نفقات_بالفئة(نفقات, فئة):
    pass # باصي بقي

اثنين = 2
ثلاثة = 3
خمسة = 5
ثمانية = 8
انطر = lambda نطرات: print(نطرات)



انطر("يا علي")
اختبار = lambda كس: كس * اثنين
انطر(list(map(اختبار, [اثنين, ثلاثة, خمسة, ثمانية])))
انطر(sum(map(اختبار, [اثنين, ثلاثة, خمسة, ثمانية])))

نفقات = []