#1. من اليمين إلى اليسار، ضاعف قيمة كل رقم ثانٍ؛ إذا كان الناتج أكبر من 9، اجمع أرقام الناتج.
#2. احسب مجموع كل الأرقام.
#3. إذا كان مجموع كل الأرقام مضاعفًا للرقم 10، فإن الرقم صحيح؛ وإلا فهو غير صحيح.

انطر = lambda نطرات: print(نطرات)
def تاكد_بطاقة_رقم(بطاقة_رقم):
    مجموع_غريب_ارقام = 0
    بطاقة_رقم_معكوس = بطاقة_رقم[::-1]
    # اطبع(بطاقة_رقم_معكوس)
    غريبة_ارقام = بطاقة_رقم_معكوس[::2]

    for رقم in غريبة_ارقام:
        (مجموع_غريب_ارقام) += int(رقم)

    مجموع_حتي_ارقام = 0
    حتي_ارقام = بطاقة_رقم_معكوس[1::2]

    for رقم in حتي_ارقام:
        عدد = int(رقم) *2
        if عدد >= 10:
            عدد = عدد // 10 + عدد % 10
        مجموع_حتي_ارقام += عدد
    توتال = مجموع_حتي_ارقام + مجموع_غريب_ارقام
    انطر(توتال)

    return 0 == توتال % 10

رئيسي = "__main__"
if __name__ == رئيسي:
    بطاقة_رقم = input(str("من فضلك أدخل و أرقامك: "))
    ترجمة_بطاقة = str.maketrans({'-': '', ' ': ''}) # ترانس؟؟؟؟ شذوذ والعياذ بالله
    مترجم_رقم_بطاقة = بطاقة_رقم.translate(ترجمة_بطاقة)

    if تاكد_بطاقة_رقم(مترجم_رقم_بطاقة):
        انطر("توب التوب!")
    else:
        انطر("زوجتي عقيمة واخاسلوك اقاربى بعدي:\nامنحنى من جانبك وريثا😫✊")