# بسم الله الرحمن الرحيم

نص = str(input("ادخل النص اخى المسلم:🙏🙏🙏"))
مفتاح_معدل = "جهنم"

def خل(رسالة, مفتاح, اتجاه=1):
    مؤشر_المفتاح = 0
    الابجدية = 'ابتثجحخدذرزسشصضطظعغفقكلمنه'
    الرسالة_النهائية = ''

    for حرف in رسالة.lower():
        # إضافة أي حرف غير حرفي إلى الرسالة.
        if not حرف.isalpha(): # if حرف  == " ":
            الرسالة_النهائية += حرف
        else:
            # ابحث عن الحرف الصحيح للترميز/فك التشفير
            حرف_مفتاح = مفتاح[مؤشر_المفتاح % len(مفتاح)]
            مؤشر_المفتاح += 1

            # تحديد الإزاحة والحرف المشفر/المفكوك التشفير
            ازاحة = الابجدية.index(حرف_مفتاح)
            فِهرِس = الابجدية.find(حرف)
            فهرس_جديد = (فِهرِس + ازاحة * اتجاه) % len(الابجدية)
            الرسالة_النهائية += الابجدية[فهرس_جديد]

    return الرسالة_النهائية

def شفر(رسالة, مفتاح):
    return خل(رسالة, مفتاح)
    # مرر الكرة يا صاح

def فك_تشفير(رسالة, مفتاح):
    return خل(رسالة, مفتاح, -1)

print(f"النص المشفر اخي المسلم: {نص}")
print(f"المفتاح: {مفتاح_معدل}")
فك_التشفير = فك_تشفير(نص, مفتاح_معدل)
print(f"النص المفكوك: {فك_التشفير}\n")
